[[rules-api-create]]
=== Create rule

Creates a new detection engine rule.

==== Request URL

`POST /api/detection_engine/rules`

==== Request body

A JSON object with these fields:

include::shared-content/rule-schema.asciidoc[tags=rules-api-json-schema;!rules-update-api]

NOTE: Rules can include both queries and filters. When both are used, make 
sure all required fields are provided.

===== Example requests

*Frank: I'd like to add an example for each `type`, including one that retrieves a saved query id and then creates a rule.*

[source,js]
--------------------------------------------------
POST api/detection_engine/rules
{
  "type": "saved_query",
  "index": [
    "packetbeat-*"
  ],
  "language": "kuery",
  "filters": [],
  "output_index": ".siem-signals",
  "query": "host.hostname : \"siem-es\" ",
  "saved_id": "packetbeat",
  "false_positives": [],
  "references": [],
  "risk_score": 21,
  "name": "All packetbeat events",
  "description": "Converts all packetbeat events from siem-es into signals",
  "severity": "low",
  "tags": [
    "packetbeat"
  ],
  "interval": "5m",
  "from": "now-300s",
  "enabled": false,
  "to": "now",
  "meta": {
    "from": "now-300s"
  }
}
--------------------------------------------------
// KIBANA

==== Response code

`200`:: 
    Indicates a successful call.
    
===== Response payload

A JSON object that includes a unique ID. If the request payload did not include a `rule_id` field, a unique rule ID is also generated.

Example response:

[source,json]
--------------------------------------------------
{
  "created_by": "elastic",
  "description": "Converts all packetbeat events from siem-es into signals",
  "enabled": false,
  "false_positives": [],
  "filters": [],
  "from": "now-300s",
  "id": "7263532e-4797-4958-a185-b1dc904e6f54",
  "immutable": false,
  "index": [
    "packetbeat-*"
  ],
  "interval": "5m",
  "rule_id": "c02b2b67-5f96-47b5-9d9a-534d355568a0",
  "language": "kuery",
  "output_index": ".siem-signals",
  "max_signals": 100,
  "risk_score": 21,
  "name": "All packetbeat events",
  "query": "host.hostname : \"siem-es\" ",
  "references": [],
  "saved_id": "packetbeat",
  "meta": {
    "from": "now-300s"
  },
  "severity": "low",
  "updated_by": "elastic",
  "tags": [
    "packetbeat"
  ],
  "to": "now",
  "type": "saved_query"
}
--------------------------------------------------